# <span style='background :beige'><span style='font-family:"Times New Roman"'>Q1. Determine the monthly operating cost of running the operations for OLA. </span>

## <span style='background :paleturquoise'><span style='font-family:"Times New Roman"'>Importing Necessary Libraries</span>

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()

## <span style='background :palegreen'><span style='font-family:"Times New Roman"'>OLŒõ Business Lines  üöóüêºüí≥</span>

In [2]:
data1=pd.DataFrame()
data1['Business Lines']=['OLA Rides','OLA Food Delivery','OLA Financial Services']
data1['Featured']=['Cabs/Autos/Bikes','FoodPanda','OLA Money']
data1['Summary']=['City Taxi‚ÜîOutstation‚ÜîRentals','Delivering Food App','Bill Payments‚ÜîOnline Shopping']
data1['Count']=['15 lakh drivers','1500 employees','150 million users']
data1

,Business Lines,Featured,Summary,Count
0,OLA Rides,Cabs/Autos/Bikes,City Taxi‚ÜîOutstation‚ÜîRentals,15 lakh drivers
1,OLA Food Delivery,FoodPanda,Delivering Food App,1500 employees
2,OLA Financial Services,OLA Money,Bill Payments‚ÜîOnline Shopping,150 million users

## <span style='background :palegreen'><span style='font-family:"Times New Roman"'>Countries of operations for OLŒõ </span>

In [3]:
data2=pd.DataFrame()
data2['Operating Countries']=['India','Australia','United Kingdom','New Zealand']
data2['Launch Date']=['December 2010','February 2018','August 2018','November 2018']
data2['Number of Drivers']=[1500000,75000,25000,10000]
data2

  Operating Countries    Launch Date  Number of Drivers
0               India  December 2010            1500000
1           Australia  February 2018              75000
2      United Kingdom    August 2018              25000
3         New Zealand  November 2018              10000

# <span style='background :beige'><span style='font-family:"Times New Roman"'>OLŒõ Cost Sructure</span>

## <span style='background :paleTURQUOISE'><span style='font-family:"Times New Roman"'>OLŒõ Rides üöóüõ∫üèçÔ∏è</span>

In [13]:
data3=pd.DataFrame()
data3['Operating Cost Factors']=['Total Income','Employees Salary','Statutory Cost','Utility Cost (Electricity)','Finance Cost','Other expenses']
data3['Description']=['15 lakh drivers','6000 employees','Average Revenue ‚Üî 18515 lakhs','5000 kWh per month','borrowing of money to build or purchase assets.','Phone Bills/Maintenance/Advertisement']
data3['Summary']=['1500‚Çπ monthly','1 lakh ‚Çπ salary','Tax ‚Üî 5555 lakhs','5000 x 8.33 x 12 hours','10.25 crores','250 crores']
data3['Total Expenses(in lakhs)']=[22500,6000,5555,5,1025,25000]
data3

,Operating Cost Factors,Description,Summary,Total Expenses(in lakhs)
0,Total Income,15 lakh drivers,1500‚Çπ monthly,22500
1,Employees Salary,6000 employees,1 lakh ‚Çπ salary,6000
2,Statutory Cost,Average Revenue ‚Üî 18515 lakhs,Tax ‚Üî 5555 lakhs,5555
3,Utility Cost (Electricity),5000 kWh per month,5000 x 8.33 x 12 hours,5
4,Finance Cost,borrowing of money to build or purchase assets.,10.25 crores,1025
5,Other expenses,Phone Bills/Maintenance/Advertisement,250 crores,25000

In [14]:
data3['Total Expenses(in lakhs)'][1:].sum()

37585

## <span style='background :khaki'><span style='font-family:"Times New Roman"'>Monthly Operating Cost : ‚Çπ375.85 Crores </span>

 ## <span style='background :paleTURQUOISE'><span style='font-family:"Times New Roman"'>OLŒõ Food Delivery  üêº Foodpanda</span>

In [6]:
data4=pd.DataFrame()
data4['Operating Cost Factors']=['Total Income','Employees Salary','Statutory Cost','Other expenses']
data4['Description']=['Annual Revenue','1500 employees','Annual Revenue ‚Üî 7213 lakhs','Phone Bills/Maintenance/Transport/Advertisement']
data4['Summary']=['7213 lakhs','20000‚Çπ monthly','Tax ‚Üî 2163 lakhs','5000 lakhs']
data4['Total Expenses(in lakhs)']=[7213,300,2163,5000]
data4

,Operating Cost Factors,Description,Summary,Total Expenses(in lakhs)
0,Total Income,Annual Revenue,7213 lakhs,7213
1,Employees Salary,1500 employees,20000‚Çπ monthly,300
2,Statutory Cost,Annual Revenue ‚Üî 7213 lakhs,Tax ‚Üî 2163 lakhs,2163
3,Other expenses,Phone Bills/Maintenance/Transport/Advertisement,5000 lakhs,5000

In [7]:
data4['Total Expenses(in lakhs)'][1:].sum()

7463

## <span style='background :khaki'><span style='font-family:"Times New Roman"'>Monthly Operating Cost : ‚Çπ74.63 Crores </span>

## <span style='background :paleturquoise'><span style='font-family:"Times New Roman"'>OLŒõ Financial Services üí≥</span>

In [8]:
data5=pd.DataFrame()
data5['Description']=['15-20% of development cost (Ola Money Wallet)','Other Expenses']
data5['Summary']=['(20% of 20000$) annually','Maintenance/Advertisement']
data5['Total Expenses(in lakhs)']=[0.25,10]
data5

,Description,Summary,Total Expenses(in lakhs)
0,15-20% of development cost (Ola Money Wallet),(20% of 20000$) annually,0.25
1,Other Expenses,Maintenance/Advertisement,10.00

In [9]:
data5['Total Expenses(in lakhs)'].sum()

10.25

## <span style='background :khaki'><span style='font-family:"Times New Roman"'>Monthly Operating Cost : ‚Çπ10.25 Lakhs </span>

# <span style='background :palegreen'><span style='font-family:"Times New Roman"'>Overall Monthly Cost for running Operations of OLA : ‚Çπ450 Crores </span>

In [10]:
(538581/12)/100

448.8175